In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [2]:
input_csv = "combined_actual.csv"

In [3]:
financial_data = pd.read_csv(input_csv)
financial_data.head()

   id  year  dow_dollars  snp500_dollars  tbm_dollars
0   0  2001  9287.039474     8695.731209     12164.29
1   1  2002  7730.122612     6663.889478     11240.88
2   2  2003  9686.694131     8421.849911     18906.64
3   3  2004  9992.759762     9179.265004     18489.81
4   4  2005  9931.369213     9454.736874     19120.15

In [6]:
financial_data = financial_data.drop(columns=["id"])
financial_data.head()

   year  dow_dollars  snp500_dollars  tbm_dollars
0  2001  9287.039474     8695.731209     12164.29
1  2002  7730.122612     6663.889478     11240.88
2  2003  9686.694131     8421.849911     18906.64
3  2004  9992.759762     9179.265004     18489.81
4  2005  9931.369213     9454.736874     19120.15

In [7]:
financial_data.index.name = "id"
financial_data.head()

    year  dow_dollars  snp500_dollars  tbm_dollars
id
0   2001  9287.039474     8695.731209     12164.29
1   2002  7730.122612     6663.889478     11240.88
2   2003  9686.694131     8421.849911     18906.64
3   2004  9992.759762     9179.265004     18489.81
4   2005  9931.369213     9454.736874     19120.15

In [8]:
financial_data.to_html('data.html')